# FTSE 100 Double Tap Back Test

In this notebook we'll read in the data, carry out a high level review and make some basic preparation and cleaning updates.

In [1]:
import pandas as pd
import numpy as np
import datetime as dt

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
!ls

FTSE4 Data Prep.ipynb FTSE4.csv

In [14]:
data = pd.read_csv("FTSE4.csv")

In [15]:
data.head()

         time    open    high     low   close
0  1587636000  5770.0  5822.0  5755.6  5798.1
1  1587650400  5797.9  5847.9  5762.1  5773.2
2  1587664800  5773.2  5796.8  5744.1  5769.5
3  1587679200  5756.8  5770.2  5731.6  5740.2
4  1587693600  5740.0  5755.0  5720.3  5744.3

In [16]:
#Convert the unix time format into python datetime
data.time = pd.to_datetime(data['time'], unit='s')

In [17]:
data.head()
#For some reason our times don't match those printed in Trading View, every row is 1 hr behind!

                 time    open    high     low   close
0 2020-04-23 10:00:00  5770.0  5822.0  5755.6  5798.1
1 2020-04-23 14:00:00  5797.9  5847.9  5762.1  5773.2
2 2020-04-23 18:00:00  5773.2  5796.8  5744.1  5769.5
3 2020-04-23 22:00:00  5756.8  5770.2  5731.6  5740.2
4 2020-04-24 02:00:00  5740.0  5755.0  5720.3  5744.3

We'll need to import timedelta to adjust these times to those shown in the chart although we should list this issue on a log of unknowns and uncertainties as the reason for the change is not known.

In [18]:
from datetime import timedelta

In [19]:
data.time = pd.to_datetime(data.time + timedelta(hours=1))

In [20]:
data.head()

                 time    open    high     low   close
0 2020-04-23 11:00:00  5770.0  5822.0  5755.6  5798.1
1 2020-04-23 15:00:00  5797.9  5847.9  5762.1  5773.2
2 2020-04-23 19:00:00  5773.2  5796.8  5744.1  5769.5
3 2020-04-23 23:00:00  5756.8  5770.2  5731.6  5740.2
4 2020-04-24 03:00:00  5740.0  5755.0  5720.3  5744.3

Ok these timestamps match the ones printed in Trading View. We'll keep wary of this anomaly.

In [22]:
data.isna().sum()

time     0
open     0
high     0
low      0
close    0
dtype: int64

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 663 entries, 0 to 662
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   time    663 non-null    datetime64[ns]
 1   open    663 non-null    float64
 2   high    663 non-null    float64
 3   low     663 non-null    float64
 4   close   663 non-null    float64
dtypes: datetime64[ns](1), float64(4)
memory usage: 26.0 KB

In [25]:
data.describe()

              open         high          low        close
count   663.000000   663.000000   663.000000   663.000000
mean   6076.815385  6101.044344  6051.292911  6076.917949
std     161.644120   160.338156   162.223110   160.999307
min    5666.700000  5734.600000  5658.200000  5666.600000
25%    5970.900000  5993.350000  5944.150000  5969.200000
50%    6074.400000  6095.800000  6051.400000  6073.700000
75%    6193.350000  6215.900000  6172.450000  6193.450000
max    6511.200000  6525.500000  6495.200000  6509.000000

In [26]:
#let's export our prepared dataset
data.to_csv('ftse_base4.csv', index=False)